In [1]:
import pandas as pd

In [10]:
LL44_rent_affordability = pd.read_csv('csv/Local_Law_44_-_Rent_Affordability_20240115.csv')

In [11]:
LL44_rent_affordability.head()

   ProjectID  BuildingID AffordabilityBand  TotalUnits
0      44218    987329.0        Low Income         101
1      44218    987329.0     Middle Income         200
2      44218    987329.0             Other           2
3      44218    987329.0   Very Low Income         101
4      44223    969695.0     Middle Income           6

In [12]:
LL44_rent_affordability.describe()

          ProjectID    BuildingID   TotalUnits
count   6420.000000  6.393000e+03  6420.000000
mean   58696.791121  4.514961e+05    26.329128
std     7908.112566  3.984601e+05    55.232463
min    44218.000000  3.750000e+02     1.000000
25%    51300.750000  6.490100e+04     2.000000
50%    58864.000000  3.264700e+05     6.000000
75%    66670.000000  9.481780e+05    23.000000
max    72160.000000  1.007121e+06  1093.000000

In [13]:
for col in LL44_rent_affordability.columns:
    print(col)

ProjectID
BuildingID
AffordabilityBand
TotalUnits